<a href="https://colab.research.google.com/github/caiuafranca/QuarentenaDadosAlura/blob/master/QuarentenaDadosAlura_Dia01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [0]:
uri = "https://raw.githubusercontent.com/alura-cursos/introducao-a-data-science/6faa8b659e98fe76d59431b14ce8cfd5315066e8/aula0/ml-latest-small/movies.csv"
dataset = pd.read_csv(uri, sep=',')
dataset.columns = ['filmesID', 'titulo', 'genero']

In [87]:
dataset.head(10)

   filmesID  ...                                       genero
0         1  ...  Adventure|Animation|Children|Comedy|Fantasy
1         2  ...                   Adventure|Children|Fantasy
2         3  ...                               Comedy|Romance
3         4  ...                         Comedy|Drama|Romance
4         5  ...                                       Comedy
5         6  ...                        Action|Crime|Thriller
6         7  ...                               Comedy|Romance
7         8  ...                           Adventure|Children
8         9  ...                                       Action
9        10  ...                    Action|Adventure|Thriller

[10 rows x 3 columns]

In [88]:
avaliacoes = pd.read_csv("https://github.com/alura-cursos/introducao-a-data-science/blob/6faa8b659e98fe76d59431b14ce8cfd5315066e8/aula0/ml-latest-small/ratings.csv?raw=true")
avaliacoes.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [89]:
avaliacoes.columns = ["usuarioID", "filmesID", "nota", "momento"]
avaliacoes

        usuarioID  filmesID  nota     momento
0               1         1   4.0   964982703
1               1         3   4.0   964981247
2               1         6   4.0   964982224
3               1        47   5.0   964983815
4               1        50   5.0   964982931
...           ...       ...   ...         ...
100831        610    166534   4.0  1493848402
100832        610    168248   5.0  1493850091
100833        610    168250   5.0  1494273047
100834        610    168252   5.0  1493846352
100835        610    170875   3.0  1493846415

[100836 rows x 4 columns]

In [0]:
datasetFinal = dataset.set_index('filmesID').join(avaliacoes.set_index('filmesID'))

In [92]:
datasetFinal.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100854 entries, 1 to 193609
Data columns (total 5 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   titulo     100854 non-null  object
 1   genero     100854 non-null  object
 2   usuarioID  100836 non-null  float64
 3   nota       100836 non-null  float64
 4   momento    100836 non-null  float64
dtypes: float64(3), object(2)
memory usage: 4.6+ MB